#+TITLE: EDX How to Code: Simple Data
#+ROAM_KEY: https://www.edx.org/course/how-to-code-simple-data
#+ROAM_TAGS: "computer science" data functions

- tags :: [[file:20200526214234-computer_science.org][computer science]], [[file:20200805181814-data_types.org][data types]],

* Beginning student language (8 lectures, 5-8 hours)
    :LOGBOOK:
    CLOCK: [2020-10-18 Sun 10:00]--[2020-10-18 Sun 12:00] =>  2:00
  :END:
  Learn to program with the core of the programming language used throughout the course.
* How to Design Functions (HtDF) Recipe (6 lectures, 4-7 hours)
  :LOGBOOK:
  CLOCK: [2020-11-01 Sun 19:56]--[2020-11-01 Sun 19:57] =>  0:01
  CLOCK: [2020-10-31 Sat 20:49]--[2020-10-31 Sat 21:17] =>  0:28
  :END:
  Learn to use the HtDF recipe to design fucntions that consume simple primitive data.
* How to Design Data (HtDD) Recipe (12 lectures, 5-8 hours)
  :PROPERTIES:
  :Effort:   5:00
  :END:
  :LOGBOOK:
  CLOCK: [2021-01-18 Mon 10:14]--[2021-01-18 Mon 12:07] =>  1:53
  CLOCK: [2020-12-24 Thu 12:21]--[2020-12-24 Thu 12:48] =>  0:27
  CLOCK: [2020-11-01 Sun 19:57]--[2020-11-01 Sun 20:09] =>  0:12
  CLOCK: [2020-08-05 Wed 18:19]--[2020-08-05 Wed 18:45] =>  0:26
  CLOCK: [2020-08-04 Tue 20:27]--[2020-08-04 Tue 20:33] =>  0:06
  CLOCK: [2020-08-04 Tue 17:43]--[2020-08-04 Tue 18:00] =>  0:17
  CLOCK: [2020-08-04 Tue 17:02]--[2020-08-04 Tue 17:09] =>  0:07
  CLOCK: [2020-08-03 Mon 19:47]--[2020-08-03 Mon 20:17] =>  0:30
  CLOCK: [2020-07-27 Mon 17:51]--[2020-07-27 Mon 18:02] =>  0:11
  CLOCK: [2020-07-27 Mon 17:19]--[2020-07-27 Mon 17:23] =>  0:04
  :END:
  Learn to use the HtDD recipe to design data definitions for atomic data.
* How to Design Worlds (HtDW) Recipe (7 lectures, 3-5 hours)
  :PROPERTIES:
  :Effort:   3:00
  :END:
  :LOGBOOK:
  CLOCK: [2021-02-24 Wed 15:43]--[2021-02-24 Wed 16:11] =>  0:28
  CLOCK: [2020-08-25 Tue 18:34]--[2020-08-25 Tue 18:58] =>  0:24
  CLOCK: [2020-08-19 Wed 19:06]--[2020-08-19 Wed 19:12] =>  0:06
  CLOCK: [2020-08-18 Tue 14:54]--[2020-08-18 Tue 15:07] =>  0:13
  CLOCK: [2020-08-17 Mon 20:02]--[2020-08-17 Mon 20:04] =>  0:02
  CLOCK: [2020-08-17 Mon 19:43]--[2020-08-17 Mon 19:55] =>  0:12
  CLOCK: [2020-08-12 Wed 18:22]--[2020-08-12 Wed 18:43] =>  0:21
  :END:
  Leanr how to use the HtDW recipe to design interactive programs with atomic world state

* Compound Data (3 lectures, 4-6 hours)
  :PROPERTIES:
  :Effort:   4:00
  :END:
  :LOGBOOK:
  CLOCK: [2020-08-26 Wed 14:59]--[2020-08-26 Wed 15:15] =>  0:16
  CLOCK: [2020-08-25 Tue 18:59]--[2020-08-25 Tue 19:08] =>  0:09
  :END:
  Leanr how to use the HtDW recipe to design interactive programs with compound world state
